backend/app/controllers/api/v1/foods_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 1], ["id", 8], ["id", 2], ["id", 5], ["id", 7], ["id", 3]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "foods".* FROM "foods" WHERE "foods"."available" = ? LIMIT ? OFFSET ?  [["available", 1], ["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "foods" WHERE "foods"."available" = ?  [["available", 1]]
---
  def index
    if @restaurant
      @foods = @restaurant.foods.available.includes(:category)
    else
      @foods = Food.available.includes(:restaurant, :category)
      @foods = @foods.where('name ILIKE ?', "%#{params[:search]}%") if params[:search].present?
      @foods = @foods.where(category_id: params[:category_id]) if params[:category_id].present?
    end

    @foods = @foods.page(params[:page]).per(12)

    render json: {
      foods: @foods.map { |food| food_json(food) },
      pagination: {