backend/app/controllers/api/v1/restaurants_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 1], ["id", 8], ["id", 2], ["id", 5], ["id", 7], ["id", 3]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."active" = ? AND (name ILIKE ?) LIMIT ? OFFSET ?  [["active", 1], [nil, "%Sad%"], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @restaurants = Restaurant.active.includes(:categories)
    @restaurants = @restaurants.where('name ILIKE ?', "%#{params[:search]}%") if params[:search].present?
    @restaurants = @restaurants.joins(:categories).where(categories: { id: params[:category_id] }) if params[:category_id].present?
    @restaurants = @restaurants.page(params[:page]).per(10)

    render json: {
      restaurants: @restaurants.map { |restaurant| restaurant_json(restaurant) },
      pagination: {